wimalopaan/wmucpp/include_stm32/usart.h
#pragma once

#include <type_traits>
#include <concepts>

#include "mcu/mcu.h"
#include "mcu/mcu_traits.h"
#include "units.h"
#include "concepts.h"
#include "etl/fifo.h"
#include "rcc.h"
#include "atomic.h"
#include "usarts.h"

namespace Mcu::Stm {
    using namespace Units::literals;
    namespace V2 {

        template<uint8_t N, typename Config, typename MCU = DefaultMcu>
        struct Uart;

        template<uint8_t N, typename Config, typename MCU = DefaultMcu>
        using LpUart = Uart<N + 100, Config, MCU>;

        template<uint8_t N, typename Config, typename MCU>
            requires (
                        ((N >= 1) && (N <= 2) && std::is_same_v<Stm32G030, MCU>) ||
                        ((N >= 1) && (N <= 6) && std::is_same_v<Stm32G0B1, MCU>) ||
                        ((N >= 1) && (N <= 3) && std::is_same_v<Stm32G431, MCU>) ||
                        ((N >= 1) && (N <= 5) && std::is_same_v<Stm32G473, MCU>) ||
                        ((N == 101)) ||
                        ((N == 102))
                    )
            struct Uart<N, Config, MCU> {
                static inline constexpr uint8_t number = N;

                using component_t = Mcu::Components::Usart<N>;

                using value_t = Config::ValueType;
                using storage_t = volatile value_t;
                using clock_t = Config::Clock;
                static inline constexpr auto size = Config::size;
                static inline constexpr auto minSize = Config::minSize;

                using dmaChRead  = Config::DmaChannelRead;
                using dmaChWrite = Config::DmaChannelWrite;
                using dmaChRW = std::conditional_t<std::is_same_v<dmaChRead, dmaChWrite>, dmaChRead, void>;

                static inline constexpr bool useDmaTCIsr = Config::useDmaTCIsr;

                static inline constexpr bool useIdleIsr = Config::useIdleIsr;
                static inline constexpr bool useRxToIsr = Config::useRxToIsr;
                static inline constexpr uint16_t rxToCount = Config::rxToCount;

                using adapter = Config::Adapter;

                using tp = Config::Debug::tp;

                static inline /*constexpr */ USART_TypeDef* const mcuUart = reinterpret_cast<USART_TypeDef*>(Mcu::Stm::Address<Mcu::Components::Usart<N>>::value);


                static inline void reset() {
                    const auto rcc = Mcu::Stm::Address<Mcu::Components::Rcc>::value;
                    if constexpr(N == 1) {
#ifdef STM32G0
                        rcc->APBRSTR2 |= RCC_APBRSTR2_USART1RST;
                        rcc->APBRSTR2 &= ~RCC_APBRSTR2_USART1RST;
#endif
#ifdef STM32G4
                        rcc->APB2RSTR |= RCC_APB2RSTR_USART1RST;
                        rcc->APB2RSTR &= ~RCC_APB2RSTR_USART1RST;
#endif
                    }
                    else if constexpr(N == 2) {
#ifdef STM32G0
                        rcc->APBRSTR1 |= RCC_APBRSTR1_USART2RST;
                        rcc->APBRSTR1 &= ~RCC_APBRSTR1_USART2RST;
#endif
#ifdef STM32G4
                        rcc->APB1RSTR1 |= RCC_APB1RSTR1_USART2RST;
                        rcc->APB1RSTR1 &= ~RCC_APB1RSTR1_USART2RST;
#endif
                    }
#ifdef STM32G0B1xx
                    else if constexpr(N == 3) {
                        rcc->APBRSTR1 |= RCC_APBRSTR1_USART3RST;
                        rcc->APBRSTR1 &= ~RCC_APBRSTR1_USART3RST;
                    }
                    else if constexpr(N == 4) {
                        rcc->APBRSTR1 |= RCC_APBRSTR1_USART4RST;
                        rcc->APBRSTR1 &= ~RCC_APBRSTR1_USART4RST;
                    }
                    else if constexpr(N == 5) {
                        rcc->APBRSTR1 = RCC_APBRSTR1_USART5RST;
                        rcc->APBRSTR1 &= ~RCC_APBRSTR1_USART5RST;
                    }
                    else if constexpr(N == 6) {
                        rcc->APBRSTR1 |= RCC_APBRSTR1_USART6RST;
                        rcc->APBRSTR1 &= ~RCC_APBRSTR1_USART6RST;
                    }
                    else if constexpr(N == 101) {
                        rcc->APBRSTR1 |= RCC_APBRSTR1_LPUART1RST;
                        rcc->APBRSTR1 &= ~RCC_APBRSTR1_LPUART1RST;
                    }
                    else if constexpr(N == 102) {
                        rcc->APBRSTR1 |= RCC_APBRSTR1_LPUART2RST;
                        rcc->APBRSTR1 &= ~RCC_APBRSTR1_LPUART2RST;
                    }
#endif
                    else {
                        static_assert(false);
                    }
                }
#ifdef STM32G0
                static inline void init() {
                    if constexpr (N == 1) {
                        RCC->APBENR2 |= RCC_APBENR2_USART1EN;
                        RCC->CCIPR |= 0x01 << RCC_CCIPR_USART1SEL_Pos;
                    }
                    else if constexpr (N == 2) {
                        RCC->APBENR1 |= RCC_APBENR1_USART2EN;
#ifdef STM32G0B1xx
                        RCC->CCIPR |= 0x01 << RCC_CCIPR_USART2SEL_Pos;
#endif
                    }
#ifdef STM32G0B1xx
                    else if constexpr (N == 3) {
                        RCC->APBENR1 |= RCC_APBENR1_USART3EN;
                        RCC->CCIPR |= 0x01 << RCC_CCIPR_USART3SEL_Pos;
                    }
                    else if constexpr (N == 4) {
                        RCC->APBENR1 |= RCC_APBENR1_USART4EN;
                    }
                    else if constexpr (N == 5) {
                        RCC->APBENR1 |= RCC_APBENR1_USART5EN;
                    }
                    else if constexpr (N == 6) {
                        RCC->APBENR1 |= RCC_APBENR1_USART6EN;
                    }
                    else if constexpr (N == 101) {
                        RCC->APBENR1 |= RCC_APBENR1_LPUART1EN;
                        RCC->CCIPR |= 0x01 << RCC_CCIPR_LPUART1SEL_Pos;
                    }
                    else if constexpr (N == 102) {
                        RCC->APBENR1 |= RCC_APBENR1_LPUART2EN;
                        RCC->CCIPR |= 0x01 << RCC_CCIPR_LPUART2SEL_Pos;
                    }
#endif
                    else {
                        static_assert(false);
                    }
                    if constexpr(N == 1) {
                        mcuUart->CR1 |= USART_CR1_FIFOEN;
                    }
#ifdef STM32G0B1xx
                    if constexpr((N == 2) || (N == 3)) {
                        mcuUart->CR1 |= USART_CR1_FIFOEN;
                    }
#endif
                    if constexpr(useRxToIsr) {
                        static_assert((N >= 1) && (N <= 3));
                        static_assert(rxToCount > 8);
                        mcuUart->CR2 |= USART_CR2_RTOEN;
                        mcuUart->CR1 |= USART_CR1_RTOIE;
                        mcuUart->RTOR = rxToCount;
                    }
                    if constexpr(useIdleIsr) {
                        mcuUart->CR1 |= USART_CR1_IDLEIE;
                    }
                    if constexpr(std::is_same_v<dmaChRead, dmaChWrite>) {
                        dmaSetupWrite(size, (uint32_t)&mWriteBuffer1[0]);
                    }
                    else {
                        if constexpr(!std::is_same_v<dmaChRead, void>) {
                            dmaChRead::init();
                            dmaChRead::template msize<value_t>();
                            dmaChRead::template psize<value_t>();
                            dmaChRead::mcuDmaChannel->CNDTR = size;
                            dmaChRead::mcuDmaChannel->CCR |= DMA_CCR_MINC;
                            dmaChRead::mcuDmaChannel->CPAR = (uint32_t)&mcuUart->RDR;
                            dmaChRead::mcuDmaChannel->CMAR = (uint32_t)&mReadBuffer1[0];
                            MODIFY_REG(dmaChRead::mcuDmaMux->CCR, DMAMUX_CxCR_DMAREQ_ID_Msk,
                                       Uarts::Properties<N>::dmamux_rx_src << DMAMUX_CxCR_DMAREQ_ID_Pos);
                            dmaChRead::enable(true);
                        }
                        if constexpr (!std::is_same_v<dmaChWrite, void>) {
                            dmaChWrite::init();
                            dmaChWrite::template msize<value_t>();
                            dmaChWrite::template psize<value_t>();
                            dmaChWrite::mcuDmaChannel->CNDTR = size;
                            dmaChWrite::mcuDmaChannel->CCR |= DMA_CCR_MINC;
                            dmaChWrite::mcuDmaChannel->CCR |= DMA_CCR_DIR;
                            if constexpr(useDmaTCIsr) {
                                dmaChWrite::mcuDmaChannel->CCR |= DMA_CCR_TCIE;
                            }
                            dmaChWrite::mcuDmaChannel->CPAR = (uint32_t)&mcuUart->TDR;
                            dmaChWrite::mcuDmaChannel->CMAR = (uint32_t)&mWriteBuffer1[0];
                            MODIFY_REG(dmaChWrite::mcuDmaMux->CCR, DMAMUX_CxCR_DMAREQ_ID_Msk,
                                       Uarts::Properties<N>::dmamux_tx_src << DMAMUX_CxCR_DMAREQ_ID_Pos);
                            // dmaChWrite::enable(true);
                        }
                        if constexpr(std::is_same_v<dmaChRead, void> && std::is_same_v<dmaChWrite, void>) {
                            static_assert(false);
                        }
                    }

                    mcuUart->CR3 |= USART_CR3_OVRDIS;
                    mcuUart->CR3 |= USART_CR3_DMAR;
                    mcuUart->CR3 |= USART_CR3_DMAT;

