wimalopaan/wmucpp/include_stm32/usart.h
            static inline ValueType put(const ValueType c) {
                mSendData.push_back(c);
                return c;
            }

            static inline std::optional<ValueType> get() {
                return mReceiveData.pop_front();
            }

            static inline bool isIdle() {
                return mcuUart->ISR & USART_ISR_TC;
            }

            static inline bool isTxQueueEmpty() {
                return mSendData.empty();
            }

            static inline void clear() {
                mSendData.clear();
                mReceiveData.clear();
            }


            static inline void periodic() {
                if (mcuUart->ISR & USART_ISR_TXE_TXFNF) {
                    if (!mSendData.empty()) {
                        mcuUart->TDR = uint8_t(*mSendData.pop_front());
                        // Byte access of USART registers not allowed according to ref-manual
                        // may be "accessed" only by 32bit words
                        //                    *(uint8_t*)(&mcuUart->TDR) = *mSendData.pop_front();
                    }
                }
                if (mcuUart->ISR & USART_ISR_RXNE_RXFNE) {
                    if constexpr (std::is_same_v<PA, void>) {
                        mReceiveData.push_back(ValueType(mcuUart->RDR));
                    }
                    else {
                        PA::process(std::byte(mcuUart->RDR));
                    }
                }
            }
            private:
            static inline etl::FiFo<ValueType, Size> mSendData;
            static inline etl::FiFo<ValueType, Size> mReceiveData;
        };
    }

}
